---
kind: property
id: P:Autodesk.Revit.DB.Analysis.PathOfTravel.LineStyle
source: html/012d6c63-fd01-a578-5b42-9a9ca095c843.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravel.LineStyle Property

The line style of the path.

## Syntax (C#)
```csharp
public ElementId LineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null